#include "REG51.h"
 
sbit led = P2^0;
unsigned int i;

void timer0_init() {
    TMOD &= 0xF0;      // 清除定时器0模式位
    TMOD |= 0x01;      // 设置定时器0为模式1 (16位定时器模式)

    TH0 = (65536 - 1000) / 256;   // 定时器高位寄存器
    TL0 = (65536 - 1000) % 256;   // 定时器低位寄存器

    ET0 = 1;           // 使能定时器0中断
    TR0 = 1;           // 启动定时器0
}

void timer0_ISR(void) interrupt 1  // 定时器0中断服务程序
{
    TH0 = (65536 - 1000) / 256;    // 重新加载定时器高位
    TL0 = (65536 - 1000) % 256;    // 重新加载定时器低位

    // 在这里添加定时器溢出时需要执行的代码
	i++;
	if (i == 200)
	{
		i = 0;
		led = ~ led;
	}
}

void main() {
	EA = 1;         // 使能全局中断
    timer0_init();     // 初始化定时器
    while(1) {
        // 主循环中的代码
    }
}
